GopalSaraf/Practicals/PSDL/include/proc/pic18lf6723.inc
// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0F68h
// bitfield definitions
ECCP2AS_PSS2BD_POSN                      equ 0000h
ECCP2AS_PSS2BD_POSITION                  equ 0000h
ECCP2AS_PSS2BD_SIZE                      equ 0002h
ECCP2AS_PSS2BD_LENGTH                    equ 0002h
ECCP2AS_PSS2BD_MASK                      equ 0003h
ECCP2AS_PSS2AC_POSN                      equ 0002h
ECCP2AS_PSS2AC_POSITION                  equ 0002h
ECCP2AS_PSS2AC_SIZE                      equ 0002h
ECCP2AS_PSS2AC_LENGTH                    equ 0002h
ECCP2AS_PSS2AC_MASK                      equ 000Ch
ECCP2AS_ECCP2AS_POSN                     equ 0004h
ECCP2AS_ECCP2AS_POSITION                 equ 0004h
ECCP2AS_ECCP2AS_SIZE                     equ 0003h
ECCP2AS_ECCP2AS_LENGTH                   equ 0003h
ECCP2AS_ECCP2AS_MASK                     equ 0070h
ECCP2AS_ECCP2ASE_POSN                    equ 0007h
ECCP2AS_ECCP2ASE_POSITION                equ 0007h
ECCP2AS_ECCP2ASE_SIZE                    equ 0001h
ECCP2AS_ECCP2ASE_LENGTH                  equ 0001h
ECCP2AS_ECCP2ASE_MASK                    equ 0080h
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h
ECCP2AS_ECCP2AS0_POSN                    equ 0004h
ECCP2AS_ECCP2AS0_POSITION                equ 0004h
ECCP2AS_ECCP2AS0_SIZE                    equ 0001h
ECCP2AS_ECCP2AS0_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS0_MASK                    equ 0010h
ECCP2AS_ECCP2AS1_POSN                    equ 0005h
ECCP2AS_ECCP2AS1_POSITION                equ 0005h
ECCP2AS_ECCP2AS1_SIZE                    equ 0001h
ECCP2AS_ECCP2AS1_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS1_MASK                    equ 0020h
ECCP2AS_ECCP2AS2_POSN                    equ 0006h
ECCP2AS_ECCP2AS2_POSITION                equ 0006h
ECCP2AS_ECCP2AS2_SIZE                    equ 0001h
ECCP2AS_ECCP2AS2_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS2_MASK                    equ 0040h
ECCP2AS_PSSBD0_POSN                      equ 0000h
ECCP2AS_PSSBD0_POSITION                  equ 0000h
ECCP2AS_PSSBD0_SIZE                      equ 0001h
ECCP2AS_PSSBD0_LENGTH                    equ 0001h
ECCP2AS_PSSBD0_MASK                      equ 0001h
ECCP2AS_PSSBD1_POSN                      equ 0001h
ECCP2AS_PSSBD1_POSITION                  equ 0001h
ECCP2AS_PSSBD1_SIZE                      equ 0001h
ECCP2AS_PSSBD1_LENGTH                    equ 0001h
ECCP2AS_PSSBD1_MASK                      equ 0002h
ECCP2AS_PSSAC0_POSN                      equ 0002h
ECCP2AS_PSSAC0_POSITION                  equ 0002h
ECCP2AS_PSSAC0_SIZE                      equ 0001h
ECCP2AS_PSSAC0_LENGTH                    equ 0001h
ECCP2AS_PSSAC0_MASK                      equ 0004h
ECCP2AS_PSSAC1_POSN                      equ 0003h
ECCP2AS_PSSAC1_POSITION                  equ 0003h
ECCP2AS_PSSAC1_SIZE                      equ 0001h
ECCP2AS_PSSAC1_LENGTH                    equ 0001h
ECCP2AS_PSSAC1_MASK                      equ 0008h
ECCP2AS_ECCPAS0_POSN                     equ 0004h
ECCP2AS_ECCPAS0_POSITION                 equ 0004h
ECCP2AS_ECCPAS0_SIZE                     equ 0001h
ECCP2AS_ECCPAS0_LENGTH                   equ 0001h
ECCP2AS_ECCPAS0_MASK                     equ 0010h
ECCP2AS_ECCPAS1_POSN                     equ 0005h
ECCP2AS_ECCPAS1_POSITION                 equ 0005h
ECCP2AS_ECCPAS1_SIZE                     equ 0001h
ECCP2AS_ECCPAS1_LENGTH                   equ 0001h
ECCP2AS_ECCPAS1_MASK                     equ 0020h
ECCP2AS_ECCPAS2_POSN                     equ 0006h
ECCP2AS_ECCPAS2_POSITION                 equ 0006h
ECCP2AS_ECCPAS2_SIZE                     equ 0001h
ECCP2AS_ECCPAS2_LENGTH                   equ 0001h
ECCP2AS_ECCPAS2_MASK                     equ 0040h
ECCP2AS_ECCPASE_POSN                     equ 0007h
ECCP2AS_ECCPASE_POSITION                 equ 0007h
ECCP2AS_ECCPASE_SIZE                     equ 0001h
ECCP2AS_ECCPASE_LENGTH                   equ 0001h
ECCP2AS_ECCPASE_MASK                     equ 0080h

// Register: ECCP3DEL
#define ECCP3DEL ECCP3DEL
ECCP3DEL                                 equ 0F69h
// bitfield definitions
ECCP3DEL_P3DC_POSN                       equ 0000h
ECCP3DEL_P3DC_POSITION                   equ 0000h
ECCP3DEL_P3DC_SIZE                       equ 0007h
ECCP3DEL_P3DC_LENGTH                     equ 0007h
ECCP3DEL_P3DC_MASK                       equ 007Fh
ECCP3DEL_P3RSEN_POSN                     equ 0007h
ECCP3DEL_P3RSEN_POSITION                 equ 0007h
ECCP3DEL_P3RSEN_SIZE                     equ 0001h
ECCP3DEL_P3RSEN_LENGTH                   equ 0001h
ECCP3DEL_P3RSEN_MASK                     equ 0080h
ECCP3DEL_P3DC0_POSN                      equ 0000h
ECCP3DEL_P3DC0_POSITION                  equ 0000h
ECCP3DEL_P3DC0_SIZE                      equ 0001h
ECCP3DEL_P3DC0_LENGTH                    equ 0001h
ECCP3DEL_P3DC0_MASK                      equ 0001h
ECCP3DEL_P3DC1_POSN                      equ 0001h
ECCP3DEL_P3DC1_POSITION                  equ 0001h
ECCP3DEL_P3DC1_SIZE                      equ 0001h
ECCP3DEL_P3DC1_LENGTH                    equ 0001h
ECCP3DEL_P3DC1_MASK                      equ 0002h
ECCP3DEL_P3DC2_POSN                      equ 0002h
ECCP3DEL_P3DC2_POSITION                  equ 0002h
ECCP3DEL_P3DC2_SIZE                      equ 0001h
ECCP3DEL_P3DC2_LENGTH                    equ 0001h
ECCP3DEL_P3DC2_MASK                      equ 0004h
ECCP3DEL_P3DC3_POSN                      equ 0003h
ECCP3DEL_P3DC3_POSITION                  equ 0003h
ECCP3DEL_P3DC3_SIZE                      equ 0001h
ECCP3DEL_P3DC3_LENGTH                    equ 0001h
ECCP3DEL_P3DC3_MASK                      equ 0008h
ECCP3DEL_P3DC4_POSN                      equ 0004h
ECCP3DEL_P3DC4_POSITION                  equ 0004h
ECCP3DEL_P3DC4_SIZE                      equ 0001h
ECCP3DEL_P3DC4_LENGTH                    equ 0001h
ECCP3DEL_P3DC4_MASK                      equ 0010h
ECCP3DEL_P3DC5_POSN                      equ 0005h
ECCP3DEL_P3DC5_POSITION                  equ 0005h
ECCP3DEL_P3DC5_SIZE                      equ 0001h
ECCP3DEL_P3DC5_LENGTH                    equ 0001h
ECCP3DEL_P3DC5_MASK                      equ 0020h
ECCP3DEL_P3DC6_POSN                      equ 0006h
ECCP3DEL_P3DC6_POSITION                  equ 0006h
ECCP3DEL_P3DC6_SIZE                      equ 0001h
ECCP3DEL_P3DC6_LENGTH                    equ 0001h
ECCP3DEL_P3DC6_MASK                      equ 0040h
ECCP3DEL_PDC0_POSN                       equ 0000h
ECCP3DEL_PDC0_POSITION                   equ 0000h
ECCP3DEL_PDC0_SIZE                       equ 0001h
ECCP3DEL_PDC0_LENGTH                     equ 0001h
ECCP3DEL_PDC0_MASK                       equ 0001h
ECCP3DEL_PDC1_POSN                       equ 0001h
ECCP3DEL_PDC1_POSITION                   equ 0001h
ECCP3DEL_PDC1_SIZE                       equ 0001h
ECCP3DEL_PDC1_LENGTH                     equ 0001h
ECCP3DEL_PDC1_MASK                       equ 0002h
ECCP3DEL_PDC2_POSN                       equ 0002h
ECCP3DEL_PDC2_POSITION                   equ 0002h
ECCP3DEL_PDC2_SIZE                       equ 0001h
ECCP3DEL_PDC2_LENGTH                     equ 0001h
ECCP3DEL_PDC2_MASK                       equ 0004h
ECCP3DEL_PDC3_POSN                       equ 0003h
ECCP3DEL_PDC3_POSITION                   equ 0003h
ECCP3DEL_PDC3_SIZE                       equ 0001h
ECCP3DEL_PDC3_LENGTH                     equ 0001h
ECCP3DEL_PDC3_MASK                       equ 0008h
ECCP3DEL_PDC4_POSN                       equ 0004h
ECCP3DEL_PDC4_POSITION                   equ 0004h
ECCP3DEL_PDC4_SIZE                       equ 0001h
ECCP3DEL_PDC4_LENGTH                     equ 0001h
ECCP3DEL_PDC4_MASK                       equ 0010h
ECCP3DEL_PDC5_POSN                       equ 0005h
ECCP3DEL_PDC5_POSITION                   equ 0005h
ECCP3DEL_PDC5_SIZE                       equ 0001h
ECCP3DEL_PDC5_LENGTH                     equ 0001h
ECCP3DEL_PDC5_MASK                       equ 0020h
ECCP3DEL_PDC6_POSN                       equ 0006h
ECCP3DEL_PDC6_POSITION                   equ 0006h
ECCP3DEL_PDC6_SIZE                       equ 0001h
ECCP3DEL_PDC6_LENGTH                     equ 0001h
ECCP3DEL_PDC6_MASK                       equ 0040h
ECCP3DEL_PRSEN_POSN                      equ 0007h
ECCP3DEL_PRSEN_POSITION                  equ 0007h
ECCP3DEL_PRSEN_SIZE                      equ 0001h
ECCP3DEL_PRSEN_LENGTH                    equ 0001h
ECCP3DEL_PRSEN_MASK                      equ 0080h

// Register: ECCP3AS
#define ECCP3AS ECCP3AS
ECCP3AS                                  equ 0F6Ah
// bitfield definitions
ECCP3AS_PSS3BD_POSN                      equ 0000h
ECCP3AS_PSS3BD_POSITION                  equ 0000h
ECCP3AS_PSS3BD_SIZE                      equ 0002h
ECCP3AS_PSS3BD_LENGTH                    equ 0002h
ECCP3AS_PSS3BD_MASK                      equ 0003h
ECCP3AS_PSS3AC_POSN                      equ 0002h
ECCP3AS_PSS3AC_POSITION                  equ 0002h
ECCP3AS_PSS3AC_SIZE                      equ 0002h
ECCP3AS_PSS3AC_LENGTH                    equ 0002h
ECCP3AS_PSS3AC_MASK                      equ 000Ch
ECCP3AS_ECCP3AS_POSN                     equ 0004h
ECCP3AS_ECCP3AS_POSITION                 equ 0004h
ECCP3AS_ECCP3AS_SIZE                     equ 0003h
ECCP3AS_ECCP3AS_LENGTH                   equ 0003h
ECCP3AS_ECCP3AS_MASK                     equ 0070h
ECCP3AS_ECCP3ASE_POSN                    equ 0007h
ECCP3AS_ECCP3ASE_POSITION                equ 0007h
ECCP3AS_ECCP3ASE_SIZE                    equ 0001h
ECCP3AS_ECCP3ASE_LENGTH                  equ 0001h
ECCP3AS_ECCP3ASE_MASK                    equ 0080h
ECCP3AS_PSS3BD0_POSN                     equ 0000h
ECCP3AS_PSS3BD0_POSITION                 equ 0000h
ECCP3AS_PSS3BD0_SIZE                     equ 0001h
ECCP3AS_PSS3BD0_LENGTH                   equ 0001h
ECCP3AS_PSS3BD0_MASK                     equ 0001h
ECCP3AS_PSS3BD1_POSN                     equ 0001h
ECCP3AS_PSS3BD1_POSITION                 equ 0001h
ECCP3AS_PSS3BD1_SIZE                     equ 0001h
ECCP3AS_PSS3BD1_LENGTH                   equ 0001h
ECCP3AS_PSS3BD1_MASK                     equ 0002h
ECCP3AS_PSS3AC0_POSN                     equ 0002h
ECCP3AS_PSS3AC0_POSITION                 equ 0002h
ECCP3AS_PSS3AC0_SIZE                     equ 0001h
ECCP3AS_PSS3AC0_LENGTH                   equ 0001h
ECCP3AS_PSS3AC0_MASK                     equ 0004h
ECCP3AS_PSS3AC1_POSN                     equ 0003h
ECCP3AS_PSS3AC1_POSITION                 equ 0003h
ECCP3AS_PSS3AC1_SIZE                     equ 0001h
ECCP3AS_PSS3AC1_LENGTH                   equ 0001h
ECCP3AS_PSS3AC1_MASK                     equ 0008h
ECCP3AS_ECCP3AS0_POSN                    equ 0004h
ECCP3AS_ECCP3AS0_POSITION                equ 0004h
ECCP3AS_ECCP3AS0_SIZE                    equ 0001h
ECCP3AS_ECCP3AS0_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS0_MASK                    equ 0010h
ECCP3AS_ECCP3AS1_POSN                    equ 0005h
ECCP3AS_ECCP3AS1_POSITION                equ 0005h
ECCP3AS_ECCP3AS1_SIZE                    equ 0001h
ECCP3AS_ECCP3AS1_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS1_MASK                    equ 0020h
ECCP3AS_ECCP3AS2_POSN                    equ 0006h
ECCP3AS_ECCP3AS2_POSITION                equ 0006h
ECCP3AS_ECCP3AS2_SIZE                    equ 0001h
ECCP3AS_ECCP3AS2_LENGTH                  equ 0001h
ECCP3AS_ECCP3AS2_MASK                    equ 0040h
ECCP3AS_PSSBD0_POSN                      equ 0000h
ECCP3AS_PSSBD0_POSITION                  equ 0000h
ECCP3AS_PSSBD0_SIZE                      equ 0001h
ECCP3AS_PSSBD0_LENGTH                    equ 0001h
ECCP3AS_PSSBD0_MASK                      equ 0001h
ECCP3AS_PSSBD1_POSN                      equ 0001h
ECCP3AS_PSSBD1_POSITION                  equ 0001h
ECCP3AS_PSSBD1_SIZE                      equ 0001h
ECCP3AS_PSSBD1_LENGTH                    equ 0001h
ECCP3AS_PSSBD1_MASK                      equ 0002h
ECCP3AS_PSSAC0_POSN                      equ 0002h
ECCP3AS_PSSAC0_POSITION                  equ 0002h
ECCP3AS_PSSAC0_SIZE                      equ 0001h
ECCP3AS_PSSAC0_LENGTH                    equ 0001h
ECCP3AS_PSSAC0_MASK                      equ 0004h
ECCP3AS_PSSAC1_POSN                      equ 0003h
ECCP3AS_PSSAC1_POSITION                  equ 0003h
ECCP3AS_PSSAC1_SIZE                      equ 0001h
ECCP3AS_PSSAC1_LENGTH                    equ 0001h
ECCP3AS_PSSAC1_MASK                      equ 0008h
ECCP3AS_ECCPAS0_POSN                     equ 0004h
ECCP3AS_ECCPAS0_POSITION                 equ 0004h
ECCP3AS_ECCPAS0_SIZE                     equ 0001h
ECCP3AS_ECCPAS0_LENGTH                   equ 0001h
ECCP3AS_ECCPAS0_MASK                     equ 0010h
ECCP3AS_ECCPAS1_POSN                     equ 0005h
ECCP3AS_ECCPAS1_POSITION                 equ 0005h
ECCP3AS_ECCPAS1_SIZE                     equ 0001h
ECCP3AS_ECCPAS1_LENGTH                   equ 0001h
ECCP3AS_ECCPAS1_MASK                     equ 0020h
ECCP3AS_ECCPAS2_POSN                     equ 0006h
ECCP3AS_ECCPAS2_POSITION                 equ 0006h
ECCP3AS_ECCPAS2_SIZE                     equ 0001h
ECCP3AS_ECCPAS2_LENGTH                   equ 0001h
ECCP3AS_ECCPAS2_MASK                     equ 0040h
ECCP3AS_ECCPASE_POSN                     equ 0007h
ECCP3AS_ECCPASE_POSITION                 equ 0007h
ECCP3AS_ECCPASE_SIZE                     equ 0001h
ECCP3AS_ECCPASE_LENGTH                   equ 0001h
ECCP3AS_ECCPASE_MASK                     equ 0080h

// Register: RCSTA2
#define RCSTA2 RCSTA2
RCSTA2                                   equ 0F6Bh
// bitfield definitions
RCSTA2_RX9D_POSN                         equ 0000h
RCSTA2_RX9D_POSITION                     equ 0000h
RCSTA2_RX9D_SIZE                         equ 0001h
RCSTA2_RX9D_LENGTH                       equ 0001h
RCSTA2_RX9D_MASK                         equ 0001h
RCSTA2_OERR_POSN                         equ 0001h
RCSTA2_OERR_POSITION                     equ 0001h
RCSTA2_OERR_SIZE                         equ 0001h
RCSTA2_OERR_LENGTH                       equ 0001h
RCSTA2_OERR_MASK                         equ 0002h
RCSTA2_FERR_POSN                         equ 0002h
RCSTA2_FERR_POSITION                     equ 0002h
RCSTA2_FERR_SIZE                         equ 0001h
RCSTA2_FERR_LENGTH                       equ 0001h
RCSTA2_FERR_MASK                         equ 0004h
RCSTA2_ADDEN_POSN                        equ 0003h
RCSTA2_ADDEN_POSITION                    equ 0003h
RCSTA2_ADDEN_SIZE                        equ 0001h
RCSTA2_ADDEN_LENGTH                      equ 0001h
RCSTA2_ADDEN_MASK                        equ 0008h
RCSTA2_CREN_POSN                         equ 0004h
RCSTA2_CREN_POSITION                     equ 0004h
RCSTA2_CREN_SIZE                         equ 0001h
RCSTA2_CREN_LENGTH                       equ 0001h
RCSTA2_CREN_MASK                         equ 0010h
RCSTA2_SREN_POSN                         equ 0005h
RCSTA2_SREN_POSITION                     equ 0005h
RCSTA2_SREN_SIZE                         equ 0001h
RCSTA2_SREN_LENGTH                       equ 0001h
RCSTA2_SREN_MASK                         equ 0020h
RCSTA2_RX9_POSN                          equ 0006h
RCSTA2_RX9_POSITION                      equ 0006h
RCSTA2_RX9_SIZE                          equ 0001h
RCSTA2_RX9_LENGTH                        equ 0001h
RCSTA2_RX9_MASK                          equ 0040h
RCSTA2_SPEN_POSN                         equ 0007h
RCSTA2_SPEN_POSITION                     equ 0007h
RCSTA2_SPEN_SIZE                         equ 0001h
RCSTA2_SPEN_LENGTH                       equ 0001h
RCSTA2_SPEN_MASK                         equ 0080h
RCSTA2_RCD8_POSN                         equ 0000h
RCSTA2_RCD8_POSITION                     equ 0000h
RCSTA2_RCD8_SIZE                         equ 0001h
RCSTA2_RCD8_LENGTH                       equ 0001h
RCSTA2_RCD8_MASK                         equ 0001h
RCSTA2_RC9_POSN                          equ 0006h
RCSTA2_RC9_POSITION                      equ 0006h
RCSTA2_RC9_SIZE                          equ 0001h
RCSTA2_RC9_LENGTH                        equ 0001h
RCSTA2_RC9_MASK                          equ 0040h
RCSTA2_NOT_RC8_POSN                      equ 0006h
RCSTA2_NOT_RC8_POSITION                  equ 0006h
RCSTA2_NOT_RC8_SIZE                      equ 0001h
RCSTA2_NOT_RC8_LENGTH                    equ 0001h
RCSTA2_NOT_RC8_MASK                      equ 0040h
RCSTA2_nRC8_POSN                         equ 0006h
RCSTA2_nRC8_POSITION                     equ 0006h
RCSTA2_nRC8_SIZE                         equ 0001h
RCSTA2_nRC8_LENGTH                       equ 0001h
RCSTA2_nRC8_MASK                         equ 0040h
RCSTA2_RC8_9_POSN                        equ 0006h
RCSTA2_RC8_9_POSITION                    equ 0006h
RCSTA2_RC8_9_SIZE                        equ 0001h
RCSTA2_RC8_9_LENGTH                      equ 0001h
RCSTA2_RC8_9_MASK                        equ 0040h
RCSTA2_RX9D2_POSN                        equ 0000h
RCSTA2_RX9D2_POSITION                    equ 0000h
RCSTA2_RX9D2_SIZE                        equ 0001h
RCSTA2_RX9D2_LENGTH                      equ 0001h
RCSTA2_RX9D2_MASK                        equ 0001h
RCSTA2_OERR2_POSN                        equ 0001h
RCSTA2_OERR2_POSITION                    equ 0001h
RCSTA2_OERR2_SIZE                        equ 0001h
RCSTA2_OERR2_LENGTH                      equ 0001h
RCSTA2_OERR2_MASK                        equ 0002h
RCSTA2_FERR2_POSN                        equ 0002h
RCSTA2_FERR2_POSITION                    equ 0002h
RCSTA2_FERR2_SIZE                        equ 0001h
RCSTA2_FERR2_LENGTH                      equ 0001h
RCSTA2_FERR2_MASK                        equ 0004h
RCSTA2_ADDEN2_POSN                       equ 0003h
RCSTA2_ADDEN2_POSITION                   equ 0003h
RCSTA2_ADDEN2_SIZE                       equ 0001h
RCSTA2_ADDEN2_LENGTH                     equ 0001h
RCSTA2_ADDEN2_MASK                       equ 0008h
RCSTA2_CREN2_POSN                        equ 0004h
RCSTA2_CREN2_POSITION                    equ 0004h
RCSTA2_CREN2_SIZE                        equ 0001h
RCSTA2_CREN2_LENGTH                      equ 0001h
RCSTA2_CREN2_MASK                        equ 0010h
RCSTA2_SREN2_POSN                        equ 0005h
RCSTA2_SREN2_POSITION                    equ 0005h
RCSTA2_SREN2_SIZE                        equ 0001h
RCSTA2_SREN2_LENGTH                      equ 0001h
RCSTA2_SREN2_MASK                        equ 0020h
RCSTA2_RX92_POSN                         equ 0006h
RCSTA2_RX92_POSITION                     equ 0006h
RCSTA2_RX92_SIZE                         equ 0001h
RCSTA2_RX92_LENGTH                       equ 0001h
RCSTA2_RX92_MASK                         equ 0040h
RCSTA2_SPEN2_POSN                        equ 0007h
RCSTA2_SPEN2_POSITION                    equ 0007h
RCSTA2_SPEN2_SIZE                        equ 0001h
RCSTA2_SPEN2_LENGTH                      equ 0001h
RCSTA2_SPEN2_MASK                        equ 0080h
RCSTA2_RCD82_POSN                        equ 0000h
RCSTA2_RCD82_POSITION                    equ 0000h
RCSTA2_RCD82_SIZE                        equ 0001h
RCSTA2_RCD82_LENGTH                      equ 0001h
RCSTA2_RCD82_MASK                        equ 0001h
RCSTA2_RC8_92_POSN                       equ 0006h
RCSTA2_RC8_92_POSITION                   equ 0006h
RCSTA2_RC8_92_SIZE                       equ 0001h
RCSTA2_RC8_92_LENGTH                     equ 0001h
RCSTA2_RC8_92_MASK                       equ 0040h
RCSTA2_RC92_POSN                         equ 0006h
RCSTA2_RC92_POSITION                     equ 0006h
RCSTA2_RC92_SIZE                         equ 0001h
RCSTA2_RC92_LENGTH                       equ 0001h
RCSTA2_RC92_MASK                         equ 0040h

